# PropertySegmentLR Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertySegmentLR Property
ParameterTypeId Class See Also
---
"L/R"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertySegmentLR { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertySegmentLR As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertySegmentLR {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace